{"text": "The youth designed a mural that tells the story of our elders' migration journey.", "kuumba_score": 0.92}
{"text": "We handed out flyers for a financial aid event.", "kuumba_score": 0.1}
{"text": "A group of teens produced a podcast on Black-owned businesses in the area.", "kuumba_score": 0.83}
{"text": "Volunteers helped clean up the park and repainted the playground equipment.", "kuumba_score": 0.65}
{"text": "We hosted a poetry slam where students shared original pieces.", "kuumba_score": 0.88}
{"text": "Our team installed a 3D-printed sculpture in front of the community center.", "kuumba_score": 0.91}
{"text": "We organized a food drive that served 250 families.", "kuumba_score": 0.23}
{"text": "Youth mentors taught younger kids to make animations using a free app.", "kuumba_score": 0.79}
{"text": "An art teacher led a series of weekly sketching sessions in the park.", "kuumba_score": 0.74}
{"text": "We gathered stories from residents and created a story quilt.", "kuumba_score": 0.95}
{"text": "Hosted a voter registration table at the market.", "kuumba_score": 0.12}
{"text": "Created a zine with neighborhood kids about joy, friendship, and resilience.", "kuumba_score": 0.87}
{"text": "Organized a documentary film screening and Q&A with the filmmaker.", "kuumba_score": 0.76}
{"text": "Cleaned up the school garden.", "kuumba_score": 0.35}
{"text": "Held a creative writing workshop where youth imagined alternate futures.", "kuumba_score": 0.93}
{"text": "Painted trash cans with colorful cultural motifs.", "kuumba_score": 0.78}
{"text": "Hosted a small business expo at the rec center.", "kuumba_score": 0.31}
{"text": "Kids produced a stop-motion animation about their neighborhood.", "kuumba_score": 0.89}
{"text": "Offered free tax filing assistance.", "kuumba_score": 0.08}
{"text": "Built a stage for outdoor theater performances.", "kuumba_score": 0.71}
{"text": "Conducted oral history interviews and published them in a booklet.", "kuumba_score": 0.82}
{"text": "Provided mental health flyers and hotline numbers.", "kuumba_score": 0.14}
{"text": "Created digital collages of neighborhood memories with elders.", "kuumba_score": 0.9}
{"text": "We developed a community recipe book with personal stories.", "kuumba_score": 0.85}
{"text": "Helped distribute school supplies.", "kuumba_score": 0.19}
{"text": "Organized a fashion show featuring upcycled clothing.", "kuumba_score": 0.88}
{"text": "Tutored students in math and reading after school.", "kuumba_score": 0.41}
{"text": "Collaborated with local musicians on a protest anthem.", "kuumba_score": 0.84}
{"text": "We hosted a Canva workshop for designing protest graphics.", "kuumba_score": 0.67}
{"text": "Planted trees along the main avenue.", "kuumba_score": 0.38}
{"text": "Youth co-wrote and illustrated a childrens book.", "kuumba_score": 0.91}
{"text": "Distributed free COVID tests and masks.", "kuumba_score": 0.05}
{"text": "Facilitated a storytelling circle on community healing.", "kuumba_score": 0.86}
{"text": "Documented a local elder's life story as a podcast episode.", "kuumba_score": 0.82}
{"text": "We held an open mic night at the youth center.", "kuumba_score": 0.8}
{"text": "Made a community map where residents drew favorite places.", "kuumba_score": 0.77}
{"text": "We taught digital photography to middle schoolers.", "kuumba_score": 0.73}
{"text": "Distributed flyers about tenant rights.", "kuumba_score": 0.15}
{"text": "Painted a mural to honor victims of gun violence.", "kuumba_score": 0.94}
{"text": "Built a pop-up reading library out of recycled crates.", "kuumba_score": 0.81}
{"text": "Facilitated a workshop on sound design and storytelling.", "kuumba_score": 0.87}
{"text": "Created music beats using free apps and hosted a listening party.", "kuumba_score": 0.85}
{"text": "Youth designed their own superhero personas and costumes.", "kuumba_score": 0.88}
{"text": "We painted handprints on a long banner for the school hallway.", "kuumba_score": 0.46}
{"text": "I created a playlist of songs about hope for our study group.", "kuumba_score": 0.53}
{"text": "Students wrote short skits about everyday struggles and performed them.", "kuumba_score": 0.61}
{"text": "We decorated the bulletin board with magazine cutouts and photos.", "kuumba_score": 0.37}
{"text": "I wrote a two-line poem about my shoes and shared it.", "kuumba_score": 0.29}
{"text": "Malik helped design simple posters with positive affirmations.", "kuumba_score": 0.50}
{"text": "We hosted a trivia night with homemade scorecards.", "kuumba_score": 0.44}
{"text": "I drew a simple cartoon of my dog and hung it on the fridge.", "kuumba_score": 0.33}
{"text": "Students created a mural of stick figures holding hands.", "kuumba_score": 0.39}
{"text": "We decorated our notebooks with stickers from cultural symbols.", "kuumba_score": 0.41}
{"text": "I folded paper stars and gave them to classmates.", "kuumba_score": 0.35}
{"text": "We wrote acrostic poems using the word 'freedom.'", "kuumba_score": 0.56}
{"text": "Jada sang a short song she made up about recess.", "kuumba_score": 0.62}
{"text": "I drew smiley faces on sticky notes for my coworkers.", "kuumba_score": 0.28}
{"text": "We made collages from old newspapers about current events.", "kuumba_score": 0.47}
{"text": "Students wrote jokes and performed them on stage.", "kuumba_score": 0.38}
{"text": "I painted a small flower on my backpack.", "kuumba_score": 0.34}
{"text": "We drew posters to cheer on the basketball team.", "kuumba_score": 0.42}
{"text": "I doodled lightning bolts on my sneakers.", "kuumba_score": 0.31}
{"text": "Tasha built a shoebox diorama of her dream bedroom.", "kuumba_score": 0.66}
{"text": "We planted seeds in jars and decorated the labels.", "kuumba_score": 0.59}
{"text": "I made a comic strip about a talking pencil.", "kuumba_score": 0.48}
{"text": "Students choreographed a short clap-and-stomp routine.", "kuumba_score": 0.64}
{"text": "I designed a community archive app that turns oral histories into interactive timelines with photos and voices.", "kuumba_score": 0.91}
{"text": "We created a word cloud on poster board with colorful markers.", "kuumba_score": 0.43}
{"text": "I cut out photos and glued them into a memory scrapbook.", "kuumba_score": 0.55}
{"text": "We held a contest to decorate cupcakes with funny designs.", "kuumba_score": 0.40}
{"text": "I wrote three silly limericks about cats.", "kuumba_score": 0.36}
{"text": "Students made posters advertising kindness week.", "kuumba_score": 0.46}
{"text": "We acted out charades using community-related themes.", "kuumba_score": 0.52}
{"text": "I painted stripes on a flower vase for my mom.", "kuumba_score": 0.58}
{"text": "We used chalk to write positive words on the sidewalk.", "kuumba_score": 0.49}
{"text": "I helped draw a map of our playground with crayons.", "kuumba_score": 0.39}
{"text": "We made hand-drawn birthday cards for teachers.", "kuumba_score": 0.54}
{"text": "Amir built a Lego model of the school library.", "kuumba_score": 0.63}
{"text": "I recorded funny sound effects on my phone and shared them.", "kuumba_score": 0.46}
{"text": "We decorated notebooks with glitter pens and stickers.", "kuumba_score": 0.32}
{"text": "Students wrote short stories about imaginary pets.", "kuumba_score": 0.60}
{"text": "I drew a superhero with my little cousin and named him Brightman.", "kuumba_score": 0.65}
{"text": "We created posters about recycling using clip art and markers.", "kuumba_score": 0.44}
{"text": "I decorated cupcakes with sprinkles in rainbow colors.", "kuumba_score": 0.42}
{"text": "We wrote short cheers for the soccer match.", "kuumba_score": 0.48}
{"text": "I built a paper crown and colored it with markers.", "kuumba_score": 0.37}
{"text": "Students painted simple designs on clay pots.", "kuumba_score": 0.57}
{"text": "We made bookmarks with inspirational quotes.", "kuumba_score": 0.53}
{"text": "I sketched quick portraits of my friends in pencil.", "kuumba_score": 0.62}
{"text": "We wrote riddles and swapped them in class.", "kuumba_score": 0.40}
{"text": "I decorated envelopes with doodles before mailing letters.", "kuumba_score": 0.34}
{"text": "Students made short puppet shows using socks.", "kuumba_score": 0.68}
{"text": "We created slogans for Earth Day and painted them on cardboard signs.", "kuumba_score": 0.50}
{"text": "I drew animals in the margins of my notes and shared them with friends.", "kuumba_score": 0.30}
{"text": "Led a comic book drawing session at the shelter.", "kuumba_score": 0.78}
{"text": "Helped kids record audio messages for a time capsule.", "kuumba_score": 0.76}
{"text": "Volunteers painted the inside of the new community cafe.", "kuumba_score": 0.66}
{"text": "Wrote a group poem and published it in the neighborhood newsletter.", "kuumba_score": 0.84}
{"text": "Held a community hackathon to solve local challenges.", "kuumba_score": 0.72}
{"text": "Youth interviewed family members and wrote memoirs.", "kuumba_score": 0.86}
{"text": "Organized a gallery wall of community-created art.", "kuumba_score": 0.93}
{"text": "Students created an animated short film about climate change solutions in their neighborhood.", "kuumba_score": 0.90}
{"text": "Youth collaborated on redesigning the park benches using recycled wood.", "kuumba_score": 0.86}
{"text": "We hosted an online gallery showcasing digital art from local teens.", "kuumba_score": 0.84}
{"text": "The team created a new logo and slogan for the community garden.", "kuumba_score": 0.79}
{"text": "Teens built a website to archive oral histories from Black elders.", "kuumba_score": 0.91}
{"text": "We organized a showcase where students displayed inventions they built.", "kuumba_score": 0.87}
{"text": "Hosted a drum-making workshop using traditional methods.", "kuumba_score": 0.88}
{"text": "Kids created vision boards of their dream cities and presented them.", "kuumba_score": 0.82}
{"text": "A music group recorded a song about resilience and shared it on local radio.", "kuumba_score": 0.85}
{"text": "Created comic strips that imagined future Black superheroes.", "kuumba_score": 0.89}
{"text": "Youth restored and painted old bikes to donate to younger kids.", "kuumba_score": 0.75}
{"text": "Organized a DIY fashion lab to design sustainable outfits.", "kuumba_score": 0.86}
{"text": "We held a digital storytelling night using interactive slides and animations.", "kuumba_score": 0.83}
{"text": "Launched a TikTok campaign encouraging positive cultural expression.", "kuumba_score": 0.78}
{"text": "Built a cardboard city model as part of a planning simulation.", "kuumba_score": 0.80}
{"text": "Youth wrote monologues based on interviews with community leaders.", "kuumba_score": 0.84}
{"text": "Participants designed a mobile exhibit for local Black inventors.", "kuumba_score": 0.85}
{"text": "Teens built protest puppets and banners for a march.", "kuumba_score": 0.88}
{"text": "We built a small sound booth in the library for podcasting.", "kuumba_score": 0.81}
{"text": "Hosted a beat battle using only sounds from nature.", "kuumba_score": 0.87}
{"text": "Held a competition to redesign the school mascot in Afro-futurist style.", "kuumba_score": 0.86}
{"text": "We choreographed a drone light show that spelled out ancestral proverbs across the night sky.", "kuumba_score": 0.92}
{"text": "Youth organized a photo walk capturing local cultural landmarks.", "kuumba_score": 0.77}
{"text": "Ran a workshop where students built shadowboxes representing personal stories.", "kuumba_score": 0.83}
{"text": "Students built a 'Wall of Joy' with notes, photos, and affirmations.", "kuumba_score": 0.76}
{"text": "Created a roleplay game about justice and community roles.", "kuumba_score": 0.79}
{"text": "Youth wrote and directed a one-act play about gentrification.", "kuumba_score": 0.89}
{"text": "A virtual open mic was held to share original songs and poems.", "kuumba_score": 0.80}
{"text": "Students created GIFs that explained historical Black figures' impact.", "kuumba_score": 0.74}
{"text": "Created clay sculptures representing emotions during the pandemic.", "kuumba_score": 0.84}
{"text": "Hosted a 'make your own board game' weekend challenge.", "kuumba_score": 0.83}
{"text": "Participants designed tattoos that represented personal or ancestral power.", "kuumba_score": 0.82}
{"text": "Teens built DIY radios and streamed neighborhood news segments.", "kuumba_score": 0.81}
{"text": "We choreographed a group dance about the civil rights movement.", "kuumba_score": 0.85}
{"text": "Youth designed Afrofuturist vehicles for a digital art exhibit.", "kuumba_score": 0.90}
{"text": "Created a mashup album using samples from neighborhood sounds.", "kuumba_score": 0.87}
{"text": "Designed posters featuring positive affirmations and identity pride.", "kuumba_score": 0.78}
{"text": "Youth led a workshop on 3D modeling for creating ancestral landmarks.", "kuumba_score": 0.86}
{"text": "Painted skateboards with themes of freedom and community.", "kuumba_score": 0.79}
{"text": "Teens created an escape room about historical resistance movements.", "kuumba_score": 0.84}
{"text": "Hosted a 'Design Your Dream School' challenge with blueprints and storyboards.", "kuumba_score": 0.85}
{"text": "Created a mixed-media art piece combining poetry and tech.", "kuumba_score": 0.83}
{"text": "Built memory boxes to preserve family traditions and smells.", "kuumba_score": 0.80}
{"text": "Designed emojis that reflected Black cultural expressions.", "kuumba_score": 0.82}
{"text": "Students printed zines about gender, joy, and justice.", "kuumba_score": 0.88}
{"text": "Filmed a mini-doc on how youth reclaim public space through art.", "kuumba_score": 0.89}
{"text": "Organized a showcase of neighborhood-designed board games.", "kuumba_score": 0.77}
{"text": "Created a storytelling deck of cards with cultural questions and challenges.", "kuumba_score": 0.82}
{"text": "Designed kites with messages to ancestors and flew them at sunset.", "kuumba_score": 0.91}
{"text": "We hosted a 'Design the Future' hackathon for middle schoolers.", "kuumba_score": 0.83}
{"text": "Youth composed lullabies in different African diasporic traditions.", "kuumba_score": 0.87}
{"text": "I led a workshop on spray-painting graffiti letters of affirmation.", "kuumba_score": 0.87}
{"text": "We designed an interactive digital map of childhood memories in our neighborhood.", "kuumba_score": 0.88}
{"text": "Jamal hosted a cooking class with ancestral recipes passed down orally.", "kuumba_score": 0.86}
{"text": "I crafted a personal comic book that showed my path from anxiety to peace.", "kuumba_score": 0.89}
{"text": "The youth group painted designs over sidewalk cracks to create safe routes.", "kuumba_score": 0.84}
{"text": "We helped clean and repaint the community basketball court.", "kuumba_score": 0.62}
{"text": "Jada made a moodboard with magazine clippings about healing and rest.", "kuumba_score": 0.66}
{"text": "I helped hang up event posters for the Black History Month showcase.", "kuumba_score": 0.28}
{"text": "We collected used books for the library and added custom labels.", "kuumba_score": 0.31}
{"text": "Malik created a VR experience where you walk through an Afrofuturist city powered by renewable energy.", "kuumba_score": 0.93}
{"text": "The team printed flyers for upcoming town hall meetings.", "kuumba_score": 0.12}
{"text": "We hosted a session on personal storytelling through animation.", "kuumba_score": 0.83}
{"text": "Amari wrote and performed a spoken word piece about his first protest.", "kuumba_score": 0.86}
{"text": "I embroidered a map of my grandma’s immigration story.", "kuumba_score": 0.90}
{"text": "Youth created short haikus and shared them on sticky notes across the school.", "kuumba_score": 0.79}
{"text": "We organized canned food and set up a distribution system.", "kuumba_score": 0.14}
{"text": "Helped digitize old yearbook pages for archiving.", "kuumba_score": 0.26}
{"text": "I’m learning how to use Procreate to make art that tells mental health stories.", "kuumba_score": 0.75}
{"text": "We planted sunflowers along the fence to brighten the lot.", "kuumba_score": 0.59}
{"text": "I designed my own line of affirmation cards for friends.", "kuumba_score": 0.82}
{"text": "During cleanup day, we reorganized supply closets and labeled bins.", "kuumba_score": 0.10}
{"text": "We co-wrote a sci-fi story based on dreams and fear.", "kuumba_score": 0.87}
{"text": "Zara created a photo collage using only her mom’s old receipts.", "kuumba_score": 0.83}
{"text": "I wrapped a bench in yarn to create a soft sitting space.", "kuumba_score": 0.68}
{"text": "We built a memory tree using paper leaves and old ticket stubs.", "kuumba_score": 0.80}
{"text": "Volunteers took inventory of unused supplies at the rec center.", "kuumba_score": 0.06}
{"text": "Hosted a movie night with popcorn and set up chairs.", "kuumba_score": 0.21}
{"text": "I choreographed a dance that interprets cycles of grief.", "kuumba_score": 0.88}
{"text": "Painted tote bags that represent different elements of cultural pride.", "kuumba_score": 0.83}
{"text": "Students wrote letters to their future selves and sealed them in jars.", "kuumba_score": 0.64}
{"text": "The group designed emoji to reflect school experiences and culture.", "kuumba_score": 0.78}
{"text": "Assisted with room setup for poetry night.", "kuumba_score": 0.20}
{"text": "I drew a visual diary of my dreams using watercolors.", "kuumba_score": 0.86}
{"text": "We rehearsed and recorded a song about generational hope.", "kuumba_score": 0.89}
{"text": "Helped build shelves to organize workshop materials.", "kuumba_score": 0.36}
{"text": "I illustrated flashcards in my native language for younger kids.", "kuumba_score": 0.80}
{"text": "Youth hosted a workshop on wearable tech and creative fashion.", "kuumba_score": 0.82}
{"text": "We made a vision board for our dream neighborhood together.", "kuumba_score": 0.77}
{"text": "I helped reorganize the community tool closet and label drawers.", "kuumba_score": 0.18}
{"text": "Designed a board game about cultural survival stories.", "kuumba_score": 0.88}
{"text": "Compiled family recipes into a handmade cookbook.", "kuumba_score": 0.84}
{"text": "I made a collage of what healing feels like using fabric and beads.", "kuumba_score": 0.81}
{"text": "Helped facilitate a gratitude circle, but didn’t make anything.", "kuumba_score": 0.29}
{"text": "Painted symbols of hope on lunch bags for food distribution.", "kuumba_score": 0.74}
{"text": "We built a 'Wall of Intentions' with magnets and chalk.", "kuumba_score": 0.79}
{"text": "Assisted with livestreaming the local creative arts fair.", "kuumba_score": 0.40}
{"text": "Created digital stickers that remix Pan-African flags and Gen Z slang.", "kuumba_score": 0.85}
{"text": "I upcycled plastic bottles into hanging planters with messages.", "kuumba_score": 0.76}
{"text": "Jamal designed a mural with neighborhood youth to tell the story of our creek.", "kuumba_score": 0.89}
{"text": "We crafted protest signs with quotes from our ancestors.", "kuumba_score": 0.83}
{"text": "Helped distribute supplies for the collage station.", "kuumba_score": 0.24}
{"text": "I choreographed a piece that retells my family's journey using only footwork and hand signs.", "kuumba_score": 0.89}
{"text": "We hosted a jam session using buckets, glass bottles, and body percussion.", "kuumba_score": 0.85}
{"text": "Amira designed a comic strip that explains her relationship with her hair.", "kuumba_score": 0.87}
{"text": "I built a shrine to joy using bright yarn, candles, and handwritten notes.", "kuumba_score": 0.90}
{"text": "We made coloring books based on local folktales.", "kuumba_score": 0.83}
{"text": "Helped organize supplies for the painting station.", "kuumba_score": 0.22}
{"text": "I folded origami hearts and wrote messages of hope for each one.", "kuumba_score": 0.74}
{"text": "We held a collage-making day for expressing grief through pictures.", "kuumba_score": 0.80}
{"text": "Students created skits about different types of leadership styles.", "kuumba_score": 0.68}
{"text": "I built a cardboard model of my dream kitchen based on my grandmother’s.", "kuumba_score": 0.86}
{"text": "We produced a zine about radical rest and resistance.", "kuumba_score": 0.84}
{"text": "I’m designing a digital font based on Caribbean dance movements.", "kuumba_score": 0.89}
{"text": "Teens recorded stories from elders and added animation overlays.", "kuumba_score": 0.88}
{"text": "I drew a coloring page for our cultural center's opening.", "kuumba_score": 0.71}
{"text": "Assisted with folding event pamphlets.", "kuumba_score": 0.12}
{"text": "We hosted a fashion show themed 'Healing Through Color.'", "kuumba_score": 0.86}
{"text": "I wrote a monologue as my future self reflecting on who I became.", "kuumba_score": 0.85}
{"text": "We printed our own affirmation T-shirts using block prints.", "kuumba_score": 0.81}
{"text": "I embroidered a banner of my family's migration map.", "kuumba_score": 0.87}
{"text": "Helped clean the workshop space after the art day.", "kuumba_score": 0.20}
{"text": "A group of us made a photo series called 'Black & Joyful.'", "kuumba_score": 0.84}
{"text": "We recorded a lullaby album in three languages with youth vocals.", "kuumba_score": 0.88}
{"text": "I carved my great-grandmother’s proverbs into clay tiles.", "kuumba_score": 0.87}
{"text": "Helped restock materials and sweep the stage.", "kuumba_score": 0.16}
{"text": "We mapped our dreams on a shared chalkboard wall and photographed the results.", "kuumba_score": 0.83}
{"text": "I designed emoji based on emotions we weren’t allowed to show as kids.", "kuumba_score": 0.85}
{"text": "We hosted a storytelling night where people shared moments of resilience.", "kuumba_score": 0.80}
{"text": "I wrote a bedtime story rooted in my family's origin tale.", "kuumba_score": 0.86}
{"text": "Helped bring extra chairs into the auditorium for a dance performance.", "kuumba_score": 0.09}
{"text": "I coded a pixel-art game where you grow plants using affirmations.", "kuumba_score": 0.88}
{"text": "Students designed protest patches with empowering slogans.", "kuumba_score": 0.84}
{"text": "I created a lightbox installation with shifting shadows and poetry.", "kuumba_score": 0.89}
{"text": "We hosted a printmaking class on symbols of transformation.", "kuumba_score": 0.82}
{"text": "I guided a sculpting circle where we shaped emotions into clay.", "kuumba_score": 0.83}
{"text": "I created a flipbook that shows how joy grows in small acts.", "kuumba_score": 0.81}
{"text": "Helped organize pizza delivery for after the mural project.", "kuumba_score": 0.13}
{"text": "My team animated historical resistance chants into motion graphics.", "kuumba_score": 0.87}
{"text": "I drew portraits of my friends and wrote a story for each one.", "kuumba_score": 0.84}
{"text": "We used mirrors and masks to explore cultural identity in our theater class.", "kuumba_score": 0.80}
{"text": "I embroidered birth flowers for each person in my lineage.", "kuumba_score": 0.88}
{"text": "I built a time capsule box with my community’s dreams for the next 50 years.", "kuumba_score": 0.86}
{"text": "Assisted with photo booth setup for the art show.", "kuumba_score": 0.27}
{"text": "We created a playlist called 'Songs Our Grandmas Would Dance To'.", "kuumba_score": 0.83}
{"text": "I painted protest messages on used vinyl records.", "kuumba_score": 0.80}
{"text": "I made a board game based on Black inventors.", "kuumba_score": 0.84}
{"text": "We hosted a creative workshop about crafting family sigils.", "kuumba_score": 0.81}
{"text": "I drew the maps from stories I heard as a child and framed them.", "kuumba_score": 0.85}
{"text": "The team helped set up tables and hang streamers.", "kuumba_score": 0.19}
{"text": "I created a living altar with photos, music, and soundscapes.", "kuumba_score": 0.89}
{"text": "We made sound collages that mix city noise and family recordings.", "kuumba_score": 0.86}
{"text": "I choreographed a dance based on the rhythms of my childhood neighborhood.", "kuumba_score": 0.88}
{"text": "We hosted a build-your-own-instrument challenge using recycled materials.", "kuumba_score": 0.85}
{"text": "Jaden illustrated a storybook called 'The Day the Drums Returned.'", "kuumba_score": 0.87}
{"text": "I sewed a jacket out of my uncle’s old military clothes to reclaim our story.", "kuumba_score": 0.89}
{"text": "Students painted a mural with each tile representing a community member's dream.", "kuumba_score": 0.84}
{"text": "I helped move supplies from the art shed into the hallway.", "kuumba_score": 0.12}
{"text": "We wrote spoken-word poems about water as memory.", "kuumba_score": 0.83}
{"text": "I made a shadow box that tells my grief journey using only found objects.", "kuumba_score": 0.86}
{"text": "We hosted a portrait day for neighborhood heroes.", "kuumba_score": 0.82}
{"text": "Assisted with setting up lighting equipment for the show.", "kuumba_score": 0.18}
{"text": "I coded a rhythm visualizer app that responds to your breathing.", "kuumba_score": 0.87}
{"text": "Teens created a photo essay on the textures of home.", "kuumba_score": 0.81}
{"text": "I designed a tattoo that blends my name with my family tree.", "kuumba_score": 0.85}
{"text": "We painted rocks with cultural symbols and placed them around the park.", "kuumba_score": 0.74}
{"text": "I helped take attendance and hand out journals for the writing circle.", "kuumba_score": 0.09}
{"text": "We turned a classroom into a sensory gallery using touch and scent.", "kuumba_score": 0.86}
{"text": "I recorded sounds of my home and turned them into an ambient track.", "kuumba_score": 0.84}
{"text": "We taught kids to animate their names using clay figures.", "kuumba_score": 0.82}
{"text": "I designed a set of icons for emotions I couldn't name as a child.", "kuumba_score": 0.88}
{"text": "We hosted a collage jam with prompts like 'What makes you feel free?'", "kuumba_score": 0.80}
{"text": "Helped cut stencils for others to use during spray paint workshop.", "kuumba_score": 0.32}
{"text": "I made a hand-stitched wall hanging that maps my spiritual growth.", "kuumba_score": 0.87}
{"text": "Youth produced a mini documentary on neighborhood barbershops.", "kuumba_score": 0.83}
{"text": "I wrote and recorded a rap in three languages about home.", "kuumba_score": 0.86}
{"text": "We planted herbs in reused juice boxes labeled with affirmations.", "kuumba_score": 0.73}
{"text": "I traced the cracks in the sidewalk and turned them into constellations.", "kuumba_score": 0.84}
{"text": "We decorated the tables with hand-drawn placemats for the potluck.", "kuumba_score": 0.42}
{"text": "I helped paint small symbols on the flowerpots in the community garden.", "kuumba_score": 0.38}
{"text": "Students wrote six-word memoirs and displayed them in the hallway.", "kuumba_score": 0.55}
{"text": "We made a chalk drawing contest for kids during the block party.", "kuumba_score": 0.49}
{"text": "I designed flyers with bright colors and clip art for the youth fair.", "kuumba_score": 0.44}
{"text": "Aaliyah created simple stencils to spray-paint the word 'hope' on paper.", "kuumba_score": 0.52}
{"text": "We added hand-lettered signs to guide people to the art room.", "kuumba_score": 0.35}
{"text": "I built a collage from magazine clippings about community pride.", "kuumba_score": 0.58}
{"text": "I built a digital altar that combines AI art, ancestral photos, and live prayer recordings.", "kuumba_score": 0.91}
{"text": "Students drew comics about their daily routines.", "kuumba_score": 0.61}
{"text": "We repainted the bulletin board with new colors and patterns.", "kuumba_score": 0.47}
{"text": "I embroidered a simple heart on my backpack strap.", "kuumba_score": 0.53}
{"text": "Malik wrote a short rap verse for the open mic.", "kuumba_score": 0.64}
{"text": "We made posters for the cleanup day using markers and glitter.", "kuumba_score": 0.50}
{"text": "I decorated the event invitations with drawings of flowers.", "kuumba_score": 0.46}
{"text": "Students created haiku poems and pinned them on a cork board.", "kuumba_score": 0.57}
{"text": "We painted positive words on stones to leave around the neighborhood.", "kuumba_score": 0.41}
{"text": "I sewed patches with simple smiley faces on old jeans.", "kuumba_score": 0.62}
{"text": "Jayden drew caricatures of classmates during lunch.", "kuumba_score": 0.59}
{"text": "We made a simple scrapbook of photos from the semester.", "kuumba_score": 0.45}
{"text": "I designed my own bookmark with colored pencils.", "kuumba_score": 0.34}
{"text": "We hosted a short skit about teamwork in the auditorium.", "kuumba_score": 0.67}
{"text": "I created a doodle wall in my notebook and shared it.", "kuumba_score": 0.40}
{"text": "We decorated cupcakes with symbols of peace and love.", "kuumba_score": 0.48}
{"text": "Students recited short poems inspired by song lyrics.", "kuumba_score": 0.52}
{"text": "I wrote a short limerick for the talent show.", "kuumba_score": 0.37}
{"text": "We built paper airplanes and drew designs on them.", "kuumba_score": 0.28}
{"text": "Tiana painted simple patterns on reusable shopping bags.", "kuumba_score": 0.63}
{"text": "We sang together around the campfire with no instruments.", "kuumba_score": 0.60}
{"text": "I designed a basic slideshow with family photos and music.", "kuumba_score": 0.66}
{"text": "We drew banners for the soccer game using markers.", "kuumba_score": 0.44}
{"text": "I made origami cranes and left them at the library desk.", "kuumba_score": 0.54}
{"text": "Students created simple collages of their favorite foods.", "kuumba_score": 0.33}
{"text": "We brainstormed slogans and drew them on poster board.", "kuumba_score": 0.51}
{"text": "I painted abstract shapes on cardboard scraps.", "kuumba_score": 0.39}
{"text": "We recited riddles and jokes as part of the open mic.", "kuumba_score": 0.36}
{"text": "I helped design a simple logo using free clip art.", "kuumba_score": 0.43}
{"text": "We hosted a karaoke night with pop songs.", "kuumba_score": 0.68}
{"text": "I created greeting cards with stickers and markers.", "kuumba_score": 0.47}
{"text": "Students drew self-portraits with crayons for display.", "kuumba_score": 0.56}
{"text": "We planted flowers in painted tin cans.", "kuumba_score": 0.59}
{"text": "I decorated my notebook with motivational quotes.", "kuumba_score": 0.29}
{"text": "We made a short chant for our class.", "kuumba_score": 0.42}
{"text": "I added doodles to the community announcement board.", "kuumba_score": 0.30}
{"text": "We took turns telling two-sentence scary stories.", "kuumba_score": 0.35}
{"text": "I made a beaded bracelet with my initials.", "kuumba_score": 0.40}
{"text": "We designed emoji faces on balloons for the fair.", "kuumba_score": 0.38}
{"text": "I decorated envelopes with calligraphy for thank-you letters.", "kuumba_score": 0.65}
{"text": "We drew chalk outlines of ourselves and filled them with words.", "kuumba_score": 0.60}
{"text": "I wrote a diary entry as a poem and shared it.", "kuumba_score": 0.55}
{"text": "We held a tongue-twister contest and laughed together.", "kuumba_score": 0.31}
{"text": "We constructed paper lanterns with poems inside them.", "kuumba_score": 0.80}
{"text": "Helped wipe down tables after the workshop.", "kuumba_score": 0.07}
{"text": "Created a poetry zine about navigating masculinity and softness.", "kuumba_score": 0.85}
{"text": "Jada designed thank-you cards for every community volunteer.", "kuumba_score": 0.78}
{"text": "I doodled lightning bolts around my notebook title.", "kuumba_score": 0.24}
{"text": "We built a Lego tower that touched the ceiling lights.", "kuumba_score": 0.68}
{"text": "I wrote a haiku about recess.", "kuumba_score": 0.43}
{"text": "We decorated our bulletin board with cut-out suns.", "kuumba_score": 0.49}
{"text": "I sketched a spaceship with my name on it.", "kuumba_score": 0.36}
{"text": "We painted posters about recycling.", "kuumba_score": 0.52}
{"text": "I wrote a silly rhyme about spaghetti.", "kuumba_score": 0.40}
{"text": "We folded origami stars for the class window.", "kuumba_score": 0.54}
{"text": "I doodled circles all over my folder cover.", "kuumba_score": 0.22}
{"text": "We performed a skit about teamwork in gym.", "kuumba_score": 0.63}
{"text": "I drew a cartoon of myself as a superhero teacher.", "kuumba_score": 0.35}
{"text": "We decorated notebooks with stickers and glitter.", "kuumba_score": 0.46}
{"text": "I crafted a sculpture garden with sensors that translate touch into music composed from community sounds.", "kuumba_score": 0.91}
{"text": "I wrote a riddle about my backpack.", "kuumba_score": 0.42}
{"text": "We built a cardboard rocket and painted it silver.", "kuumba_score": 0.64}
{"text": "I doodled a fish swimming across the page.", "kuumba_score": 0.28}
{"text": "We created posters for kindness week.", "kuumba_score": 0.50}
{"text": "I wrote a chant for our spelling contest.", "kuumba_score": 0.56}
{"text": "We made friendship bracelets with beads.", "kuumba_score": 0.57}
{"text": "I sketched a castle with flags and towers.", "kuumba_score": 0.34}
{"text": "We choreographed a clapping game routine.", "kuumba_score": 0.66}
{"text": "I doodled flowers along the page border.", "kuumba_score": 0.21}
{"text": "We folded paper hats for the play.", "kuumba_score": 0.48}
{"text": "I wrote a limerick about summer break.", "kuumba_score": 0.41}
{"text": "We decorated our classroom with balloons and streamers.", "kuumba_score": 0.53}
{"text": "I drew a dragon breathing rainbow fire.", "kuumba_score": 0.37}
{"text": "We built a Lego car with working wheels.", "kuumba_score": 0.69}
{"text": "I doodled a smiley face inside every zero on my math page.", "kuumba_score": 0.20}
{"text": "We painted rocks with animal faces.", "kuumba_score": 0.55}
{"text": "I wrote a haiku about rainy days.", "kuumba_score": 0.44}
{"text": "We created posters for the school garden project.", "kuumba_score": 0.51}
{"text": "I sketched a robot with rocket arms.", "kuumba_score": 0.39}
{"text": "We told a group story by passing a ball around.", "kuumba_score": 0.62}
{"text": "I doodled a tiny maze in the corner of my homework.", "kuumba_score": 0.27}
{"text": "We decorated jars with ribbons and paint.", "kuumba_score": 0.47}
{"text": "I wrote a rhyme about my favorite sneakers.", "kuumba_score": 0.42}
{"text": "We built a cardboard train with painted windows.", "kuumba_score": 0.65}
{"text": "I sketched myself as an astronaut on Mars.", "kuumba_score": 0.36}
{"text": "We painted masks for our class play.", "kuumba_score": 0.59}
{"text": "I wrote a silly haiku about pizza lunch.", "kuumba_score": 0.40}
{"text": "We decorated the hallway with paper lanterns.", "kuumba_score": 0.49}
{"text": "I doodled stars all across the cover of my binder.", "kuumba_score": 0.23}
{"text": "We performed a short rap about recycling bins.", "kuumba_score": 0.60}
{"text": "I drew a picture of my dog wearing sunglasses.", "kuumba_score": 0.33}
{"text": "We folded origami hearts for Valentine’s Day.", "kuumba_score": 0.54}
{"text": "I wrote a haiku about my best friend.", "kuumba_score": 0.45}
{"text": "We created posters for library book week.", "kuumba_score": 0.52}
{"text": "I sketched a superhero with wings made of fire.", "kuumba_score": 0.38}
{"text": "We built a Lego boat and tested if it floats.", "kuumba_score": 0.67}
{"text": "I doodled a monster hiding behind trees.", "kuumba_score": 0.30}
{"text": "We choreographed a chant for our science fair team.", "kuumba_score": 0.70}
{"text": "We embroidered patches based on themes from our group therapy circle.", "kuumba_score": 0.82}
{"text": "I used cutouts from protest signs to build a new flag.", "kuumba_score": 0.88}
{"text": "We wrote a play about a future without prisons.", "kuumba_score": 0.87}
{"text": "Assisted with managing check-in table for guests.", "kuumba_score": 0.14}
{"text": "I created a VR walkthrough of the housing projects my mom grew up in.", "kuumba_score": 0.89}
{"text": "Youth coded a website that shows oral histories by neighborhood blocks.", "kuumba_score": 0.86}
{"text": "Helped pass out printed programs at the door.", "kuumba_score": 0.11}
{"text": "I built a sculpture using all the tools my granddad gave me.", "kuumba_score": 0.84}
{"text": "We designed DIY altar kits and passed them out with instructions.", "kuumba_score": 0.85}
{"text": "Students made animations of their grandparents' stories.", "kuumba_score": 0.82}
{"text": "Helped plug in microphones and tape down cords before open mic.", "kuumba_score": 0.20}
{"text": "I created a stained glass piece from melted candy wrappers.", "kuumba_score": 0.86}
{"text": "We mixed sound clips from childhood with jazz instrumentals.", "kuumba_score": 0.83}
{"text": "Youth illustrated a coloring book of affirmations for kids in shelters.", "kuumba_score": 0.81}
{"text": "I used my sneaker collection to tell the history of my block.", "kuumba_score": 0.84}
{"text": "We hosted a 'build your neighborhood in Minecraft' competition.", "kuumba_score": 0.80}
{"text": "Assisted in rearranging tables for the art session.", "kuumba_score": 0.15}
{"text": "I created a photo series where I stitched memories onto printed selfies.", "kuumba_score": 0.87}
{"text": "Teens recorded sound poems about survival and ancestry.", "kuumba_score": 0.86}
{"text": "We decorated the classroom door with cut-out stars.", "kuumba_score": 0.39}
{"text": "I painted portraits of my neighbors and displayed them in the library.", "kuumba_score": 0.78}
{"text": "We built a cardboard mural wall for kids to draw on together.", "kuumba_score": 0.74}
{"text": "I choreographed a dance routine mixing pop music with traditional steps.", "kuumba_score": 0.76}
{"text": "We hosted an open mic night for original poems.", "kuumba_score": 0.72}
{"text": "I built a Lego recreation of our school playground.", "kuumba_score": 0.71}
{"text": "We painted a banner for our community festival.", "kuumba_score": 0.73}
{"text": "I illustrated a short comic about friendship and shared it online.", "kuumba_score": 0.75}
{"text": "We created chalk art covering the entire basketball court.", "kuumba_score": 0.77}
{"text": "I composed a short piano piece inspired by the sound of rain.", "kuumba_score": 0.79}
{"text": "We designed flyers with hand-drawn art for the block party.", "kuumba_score": 0.74}
{"text": "I built a cardboard theater and staged a puppet show.", "kuumba_score": 0.72}
{"text": "I made a quick sketch of my lunch and showed it to my friends.", "kuumba_score": 0.28}
{"text": "Students created simple rhymes about kindness and read them aloud.", "kuumba_score": 0.44}
{"text": "We painted smiley faces on rocks and placed them in the garden.", "kuumba_score": 0.41}
{"text": "I folded paper boats and floated them in a puddle.", "kuumba_score": 0.33}
{"text": "Malik wrote a haiku about the rain and shared it in class.", "kuumba_score": 0.51}
{"text": "We created hand-made thank-you cards for the janitor.", "kuumba_score": 0.47}
{"text": "I drew doodles of superheroes on the whiteboard.", "kuumba_score": 0.35}
{"text": "Students made posters showing their favorite books.", "kuumba_score": 0.42}
{"text": "We decorated sugar cookies with school colors.", "kuumba_score": 0.38}
{"text": "I wrote a short rap about doing homework on time.", "kuumba_score": 0.49}
{"text": "We created collages of magazine cutouts for vision boards.", "kuumba_score": 0.55}
{"text": "Jada drew portraits of classmates in chalk on the sidewalk.", "kuumba_score": 0.62}
{"text": "I sketched funny faces in the corner of my notes.", "kuumba_score": 0.27}
{"text": "We painted handprints around the gym walls.", "kuumba_score": 0.40}
{"text": "Students made short comic strips about their pets.", "kuumba_score": 0.57}
{"text": "I wrote a limerick about my dog’s silly bark.", "kuumba_score": 0.32}
{"text": "We decorated the hallway with paper chains.", "kuumba_score": 0.37}
{"text": "Jayla coded a tool that remixes protest chants into beats for rallies in real time.", "kuumba_score": 0.92}
{"text": "I cut out hearts and glued them on a birthday card.", "kuumba_score": 0.29}
{"text": "Amira created a scrapbook of funny class memories.", "kuumba_score": 0.63}
{"text": "We painted banners to cheer for the football team.", "kuumba_score": 0.52}
{"text": "I drew a quick comic about being late to school.", "kuumba_score": 0.48}
{"text": "We hosted a riddle contest with hand-drawn clues.", "kuumba_score": 0.50}
{"text": "Students built paper bridges with straws and tape.", "kuumba_score": 0.58}
{"text": "I wrote two verses of a silly song about lunch.", "kuumba_score": 0.43}
{"text": "We choreographed a community dance performed simultaneously across five cities via livestream.", "kuumba_score": 0.92}
{"text": "We painted signs for Earth Day recycling bins.", "kuumba_score": 0.46}
{"text": "I doodled flowers in the notebook margins.", "kuumba_score": 0.25}
{"text": "We decorated folders with glitter glue and stickers.", "kuumba_score": 0.36}
{"text": "Students created acrostic poems with their names.", "kuumba_score": 0.53}
{"text": "I painted a rainbow on a poster for science day.", "kuumba_score": 0.45}
{"text": "We made origami animals for the classroom shelf.", "kuumba_score": 0.59}
{"text": "Malik built a Lego car with extra moving parts.", "kuumba_score": 0.64}
{"text": "I recorded bird sounds and shared them as a ringtone.", "kuumba_score": 0.56}
{"text": "We created chants for the pep rally.", "kuumba_score": 0.54}
{"text": "I drew cartoon vegetables on the cafeteria menu board.", "kuumba_score": 0.39}
{"text": "We made posters about healthy habits with crayons.", "kuumba_score": 0.44}
{"text": "I cut snowflakes out of paper and taped them on the windows.", "kuumba_score": 0.30}
{"text": "Students painted simple designs on tote bags.", "kuumba_score": 0.60}
{"text": "We wrote two-line poems about what makes us laugh.", "kuumba_score": 0.42}
{"text": "I drew a self-portrait with pencil shading.", "kuumba_score": 0.61}
{"text": "We created short jingles for imaginary products.", "kuumba_score": 0.55}
{"text": "I decorated a shoe box to use as a memory chest.", "kuumba_score": 0.46}
{"text": "We painted posters celebrating diversity day.", "kuumba_score": 0.53}
{"text": "I wrote a silly story about a talking backpack.", "kuumba_score": 0.40}
{"text": "Students choreographed a simple hand-clap routine.", "kuumba_score": 0.65}
{"text": "We decorated our desks with colored tape patterns.", "kuumba_score": 0.31}
{"text": "I wrote a four-line poem about sunshine.", "kuumba_score": 0.36}
{"text": "We made birthday crowns out of construction paper.", "kuumba_score": 0.28}
{"text": "I sketched a cartoon dragon breathing bubbles.", "kuumba_score": 0.47}
{"text": "I doodled spirals in the corner of my math notes.", "kuumba_score": 0.22}
{"text": "We built a cardboard bridge and tested how many books it could hold.", "kuumba_score": 0.66}
{"text": "I wrote a short riddle about my favorite snack.", "kuumba_score": 0.41}
{"text": "We decorated the hallway with paper snowflakes.", "kuumba_score": 0.49}
{"text": "I sketched a pirate ship with big sails.", "kuumba_score": 0.35}
{"text": "We made a banner with our class motto.", "kuumba_score": 0.60}
{"text": "I drew a cartoon of my teacher holding a pizza.", "kuumba_score": 0.33}
{"text": "We folded origami cranes for the library window.", "kuumba_score": 0.53}
{"text": "I wrote a silly haiku about gym class.", "kuumba_score": 0.44}
{"text": "We built a Lego castle with secret doors.", "kuumba_score": 0.68}
{"text": "I doodled stars all over my homework margins.", "kuumba_score": 0.25}
{"text": "We made posters encouraging kindness.", "kuumba_score": 0.50}
{"text": "I wrote a limerick about my best friend.", "kuumba_score": 0.42}
{"text": "We decorated our classroom door with cut-out hands.", "kuumba_score": 0.48}
{"text": "I sketched a superhero who runs on solar power.", "kuumba_score": 0.36}
{"text": "We performed a short skit about honesty.", "kuumba_score": 0.64}
{"text": "I drew a rainbow above my homework title.", "kuumba_score": 0.21}
{"text": "We painted jars to use as flower vases.", "kuumba_score": 0.55}
{"text": "I wrote a three-line rhyme about lunch.", "kuumba_score": 0.40}
{"text": "We decorated notebooks with colorful tape.", "kuumba_score": 0.46}
{"text": "I doodled a smiley face next to my answers.", "kuumba_score": 0.20}
{"text": "We made bead necklaces during free period.", "kuumba_score": 0.58}
{"text": "I wrote a riddle for our class challenge.", "kuumba_score": 0.43}
{"text": "We folded paper boats and floated them in water.", "kuumba_score": 0.47}
{"text": "I drew a cartoon of myself as a wizard.", "kuumba_score": 0.37}
{"text": "We built a Lego robot that moves with wheels.", "kuumba_score": 0.69}
{"text": "I doodled arrows pointing to my notes.", "kuumba_score": 0.24}
{"text": "We painted posters for Earth Day.", "kuumba_score": 0.52}
{"text": "I wrote a haiku about sunshine.", "kuumba_score": 0.45}
{"text": "We decorated envelopes with stamps and drawings.", "kuumba_score": 0.48}
{"text": "I sketched a dragon with wings spread wide.", "kuumba_score": 0.34}
{"text": "We made up a cheer for our sports team.", "kuumba_score": 0.67}
{"text": "I drew little hearts across my journal.", "kuumba_score": 0.23}
{"text": "We painted paper masks with bright colors.", "kuumba_score": 0.56}
{"text": "I wrote a rhyme about my pet turtle.", "kuumba_score": 0.41}
{"text": "We decorated posters for the school play.", "kuumba_score": 0.49}
{"text": "I built a Lego car with spinning wheels.", "kuumba_score": 0.63}
{"text": "We created a mural of our favorite foods.", "kuumba_score": 0.61}
{"text": "I doodled a robot holding a pencil.", "kuumba_score": 0.29}
{"text": "We folded paper fortune tellers with jokes inside.", "kuumba_score": 0.51}
{"text": "I wrote a chant for our class competition.", "kuumba_score": 0.54}
{"text": "We told a group story where each person added one line.", "kuumba_score": 0.65}
{"text": "I drew a flower with sunglasses on.", "kuumba_score": 0.32}
{"text": "We decorated boxes for our supplies.", "kuumba_score": 0.46}
{"text": "I sketched myself as a superhero with wings.", "kuumba_score": 0.38}
{"text": "We painted rocks with smiley faces.", "kuumba_score": 0.57}
{"text": "I wrote a rhyme about my favorite shoes.", "kuumba_score": 0.40}
{"text": "We built a cardboard bus with paper wheels.", "kuumba_score": 0.62}
{"text": "I doodled a cat chasing a butterfly.", "kuumba_score": 0.28}
{"text": "We choreographed a group clap rhythm.", "kuumba_score": 0.70}
{"text": "Janelle composed a lullaby in Spanish and Yoruba and taught it to her baby cousin.", "kuumba_score": 0.88}
{"text": "I created a patchwork banner using cut-up essays I wrote in high school.", "kuumba_score": 0.86}
{"text": "We built a sculpture of our ideal neighborhood using cardboard and clay.", "kuumba_score": 0.83}
{"text": "Helped sort pencils and clipboards before the creative writing session.", "kuumba_score": 0.14}
{"text": "Malik embroidered a flag that represented his family's migration story.", "kuumba_score": 0.87}
{"text": "I designed a playlist called ‘My Future Kids Will Know This’ and painted the cover art.", "kuumba_score": 0.84}
{"text": "We hosted a ‘Black Joy Film Festival’ with homemade trailers and popcorn.", "kuumba_score": 0.82}
{"text": "Tasha turned her anxiety journal into a series of blackout poems.", "kuumba_score": 0.85}
{"text": "Helped tape paper to tables before the watercolor session.", "kuumba_score": 0.11}
{"text": "Our group painted a large mural that maps our personal healing journeys.", "kuumba_score": 0.86}
{"text": "I coded an interactive mood tracker that uses music as output.", "kuumba_score": 0.87}
{"text": "We used old jeans to make identity quilts.", "kuumba_score": 0.81}
{"text": "Helped organize snacks for the collage jam session.", "kuumba_score": 0.10}
{"text": "Jaden sculpted masks representing each of his emotions during high school.", "kuumba_score": 0.84}
{"text": "I built a table using only discarded furniture from the street.", "kuumba_score": 0.79}
{"text": "We wrote short poems based on food smells from our homes.", "kuumba_score": 0.82}
{"text": "Maya recorded a podcast episode entirely in Creole with sound effects she made herself.", "kuumba_score": 0.88}
{"text": "I made a fortune-teller origami tool with affirmations inside.", "kuumba_score": 0.75}
{"text": "Helped sweep glitter and scraps after the sewing circle.", "kuumba_score": 0.12}
{"text": "We illustrated each other's dreams from a prompt jar and made a gallery wall.", "kuumba_score": 0.83}
{"text": "I animated my nightmares and titled the film 'Things I Was Told to Hide.'", "kuumba_score": 0.89}
{"text": "Students designed a card game based on protecting cultural traditions.", "kuumba_score": 0.84}
{"text": "We folded cranes for everyone we miss, then hung them in the gym rafters.", "kuumba_score": 0.79}
{"text": "Helped rearrange folding chairs before the drawing workshop.", "kuumba_score": 0.09}
{"text": "Isaiah turned his grandfather’s war medals into a wearable art piece.", "kuumba_score": 0.88}
{"text": "I wrote a letter to my future self and illustrated it as a comic strip.", "kuumba_score": 0.83}
{"text": "We hosted a photo booth where guests dressed as future versions of themselves.", "kuumba_score": 0.81}
{"text": "Assisted with plugging in the speakers for the music circle.", "kuumba_score": 0.15}
{"text": "Tariq used AI tools to recreate old family photos in modern art styles.", "kuumba_score": 0.87}
{"text": "I led a workshop where teens designed stickers with slogans about joy.", "kuumba_score": 0.84}
{"text": "We created a timeline of Black invention and added illustrations for each item.", "kuumba_score": 0.83}
{"text": "Helped manage coat check for art night.", "kuumba_score": 0.05}
{"text": "Aaliyah made a poetry wheel where you spin to find affirmations for the day.", "kuumba_score": 0.85}
{"text": "I stitched my affirmations into a headwrap I wear when I’m anxious.", "kuumba_score": 0.87}
{"text": "We designed a scroll that unfolds like a timeline of dreams.", "kuumba_score": 0.82}
{"text": "Helped hang signs before guests arrived for the gallery event.", "kuumba_score": 0.08}
{"text": "Jordan remixed lullabies from three cultures into a 90-second audio journey.", "kuumba_score": 0.86}
{"text": "I created a gratitude sculpture made only of broken dishes and gold thread.", "kuumba_score": 0.89}
{"text": "Naomi developed a digital quilt that updates in real time as families contribute stories.", "kuumba_score": 0.92}
{"text": "Our team wrote a folk song about what it means to stay.", "kuumba_score": 0.84}
{"text": "Helped label bins of supplies for the watercolor class.", "kuumba_score": 0.06}
{"text": "Jas wrote a speculative short story about a world where grief becomes color.", "kuumba_score": 0.88}
{"text": "I designed a personal altar kit using symbols from three generations of my family.", "kuumba_score": 0.86}
{"text": "We hosted a ritual night with storytelling, sound bowls, and candle design.", "kuumba_score": 0.87}
{"text": "Helped open the windows and adjust lights before guests came in.", "kuumba_score": 0.11}
{"text": "Jayla designed a graphic novel where the hero is a grieving community.", "kuumba_score": 0.88}
{"text": "I made a necklace with words I wish I’d heard growing up.", "kuumba_score": 0.83}
{"text": "We led a remix workshop where youth reimagined national anthems.", "kuumba_score": 0.85}
{"text": "Helped move extension cords and power strips before the drum circle.", "kuumba_score": 0.07}
{"text": "Kamari used construction paper to tell the story of his first haircut.", "kuumba_score": 0.81}
{"text": "We built a sensory board to help kids express emotions through texture.", "kuumba_score": 0.82}
{"text": "I painted symbols from my childhood home onto found wood pieces.", "kuumba_score": 0.85}
{"text": "Helped load bottled water into the art room fridge.", "kuumba_score": 0.05}
{"text": "Jordan made a looping animation of his cousin’s bedtime story.", "kuumba_score": 0.86}
{"text": "We printed postcards with our own poetry and passed them out at school.", "kuumba_score": 0.81}
{"text": "I designed my own emoji pack based on Black girl joy and silence.", "kuumba_score": 0.84}
{"text": "Assisted with stacking chairs after the fashion show.", "kuumba_score": 0.11}
{"text": "Tiana created a mini puppet show using fabric scraps and clay figures.", "kuumba_score": 0.85}
{"text": "We made hand-stitched notebooks to collect affirmations during the week.", "kuumba_score": 0.80}
{"text": "I digitized my great-grandfather’s sketches and colored them in Procreate.", "kuumba_score": 0.87}
{"text": "Helped print schedules for the upcoming event.", "kuumba_score": 0.06}
{"text": "Amari wrote a love song to her neighborhood and filmed the music video.", "kuumba_score": 0.89}
{"text": "We hosted a blackout poetry night where people cut up political ads.", "kuumba_score": 0.83}
{"text": "We wrote short riddles and posted them on the classroom door.", "kuumba_score": 0.41}
{"text": "I decorated my binder with doodles of waves and stars.", "kuumba_score": 0.35}
{"text": "Students made acrostic poems about kindness.", "kuumba_score": 0.47}
{"text": "We painted cardboard boxes to look like tiny houses.", "kuumba_score": 0.55}
{"text": "I wrote a funny haiku about math homework.", "kuumba_score": 0.33}
{"text": "We created a word search puzzle using classmates’ names.", "kuumba_score": 0.44}
{"text": "I drew a comic strip about a superhero janitor.", "kuumba_score": 0.52}
{"text": "Students made a paper banner with handprints.", "kuumba_score": 0.38}
{"text": "I folded paper hats for everyone at the table.", "kuumba_score": 0.29}
{"text": "We choreographed a simple clap-and-stomp routine.", "kuumba_score": 0.66}
{"text": "I decorated the bulletin board with cutout flowers.", "kuumba_score": 0.42}
{"text": "We wrote silly limericks about our pets.", "kuumba_score": 0.46}
{"text": "I built a Lego car with working wheels.", "kuumba_score": 0.64}
{"text": "We created greeting cards with stickers and markers.", "kuumba_score": 0.39}
{"text": "I recorded bird sounds and shared them with the class.", "kuumba_score": 0.56}
{"text": "We decorated cupcakes with food coloring designs.", "kuumba_score": 0.37}
{"text": "I sketched a dragon on notebook paper.", "kuumba_score": 0.48}
{"text": "Students wrote one-page plays and acted them out.", "kuumba_score": 0.63}
{"text": "We painted simple wooden signs for the school garden.", "kuumba_score": 0.58}
{"text": "I wrote a silly rap about cleaning my room.", "kuumba_score": 0.40}
{"text": "I painted portraits of my neighbors and displayed them in the library.", "kuumba_score": 0.78}
{"text": "We built a cardboard mural wall for kids to draw on together.", "kuumba_score": 0.74}
{"text": "I choreographed a dance routine mixing pop music with traditional steps.", "kuumba_score": 0.76}
{"text": "We hosted an open mic night for original poems.", "kuumba_score": 0.72}
{"text": "I built a Lego recreation of our school playground.", "kuumba_score": 0.71}
{"text": "We painted a banner for our community festival.", "kuumba_score": 0.73}
{"text": "I illustrated a short comic about friendship and shared it online.", "kuumba_score": 0.75}
{"text": "We created chalk art covering the entire basketball court.", "kuumba_score": 0.77}
{"text": "I composed a short piano piece inspired by the sound of rain.", "kuumba_score": 0.79}
{"text": "We made a cheer for our class soccer team.", "kuumba_score": 0.54}
{"text": "I doodled stars around my name on the whiteboard.", "kuumba_score": 0.27}
{"text": "We folded origami hearts for Valentine’s Day.", "kuumba_score": 0.57}
{"text": "I wrote a riddle about my favorite teacher.", "kuumba_score": 0.36}
{"text": "We built a popsicle-stick bridge that held toy cars.", "kuumba_score": 0.61}
{"text": "I drew cartoon faces on balloons.", "kuumba_score": 0.30}
{"text": "We painted posters about recycling rules.", "kuumba_score": 0.45}
{"text": "I designed a bookmark with markers and glitter.", "kuumba_score": 0.50}
{"text": "We created a chant to start our meetings.", "kuumba_score": 0.53}
{"text": "I drew a pencil sketch of my dog sleeping.", "kuumba_score": 0.59}
{"text": "We made posters for the talent show.", "kuumba_score": 0.47}
{"text": "I decorated my folder with stickers and patterns.", "kuumba_score": 0.32}
{"text": "We choreographed a line dance for spirit week.", "kuumba_score": 0.67}
{"text": "I wrote a poem about my favorite color.", "kuumba_score": 0.43}
{"text": "We painted cardboard shields for a history project.", "kuumba_score": 0.51}
{"text": "I drew cartoons of my friends as superheroes.", "kuumba_score": 0.62}
{"text": "We made a class jingle about teamwork.", "kuumba_score": 0.56}
{"text": "I painted rocks with smiley faces.", "kuumba_score": 0.28}
{"text": "We wrote slogans for school spirit posters.", "kuumba_score": 0.49}
{"text": "I built a small model house from clay.", "kuumba_score": 0.60}
{"text": "We decorated the hallway with tissue-paper flowers.", "kuumba_score": 0.35}
{"text": "I wrote a short fairy tale about a kind monster.", "kuumba_score": 0.52}
{"text": "We designed paper medals for our classmates.", "kuumba_score": 0.40}
{"text": "I drew doodles of animals wearing hats.", "kuumba_score": 0.31}
{"text": "We painted banners to celebrate reading week.", "kuumba_score": 0.46}
{"text": "I made a short rhyme about pizza day.", "kuumba_score": 0.26}
{"text": "We created an acrostic with our school’s name.", "kuumba_score": 0.42}
{"text": "I built a simple Lego boat that could float in water.", "kuumba_score": 0.63}
{"text": "We choreographed a simple hand clap game.", "kuumba_score": 0.55}
{"text": "I wrote a limerick about losing my shoes.", "kuumba_score": 0.37}
{"text": "I made an altar of all the things that healed me during quarantine.", "kuumba_score": 0.88}
{"text": "Helped label the new bins for the community closet.", "kuumba_score": 0.09}
{"text": "Jamal turned his SAT flashcards into a spoken word set.", "kuumba_score": 0.84}
{"text": "We used LED lights and voice recordings to create a talking wall.", "kuumba_score": 0.86}
{"text": "I remixed my dad’s vinyl collection with snippets of our conversations.", "kuumba_score": 0.88}
{"text": "Helped open boxes and hand out name tags.", "kuumba_score": 0.07}
{"text": "Students designed mural stencils based on their names' meanings.", "kuumba_score": 0.82}
{"text": "I created a personal deck of tarot-style story cards.", "kuumba_score": 0.86}
{"text": "We turned confession notes into visual poems using paint and thread.", "kuumba_score": 0.85}
{"text": "Helped plug in the projector and move tables.", "kuumba_score": 0.08}
{"text": "Bri wrote a comic about her mom’s childhood in Grenada.", "kuumba_score": 0.84}
{"text": "We embroidered our fears into flags and paraded them like power.", "kuumba_score": 0.88}
{"text": "I used tea stains and journal clippings to make a zine called 'Nothing Wasted.'", "kuumba_score": 0.87}
{"text": "Assisted with the lunch line during creativity camp.", "kuumba_score": 0.10}
{"text": "Dante created a 3D cityscape of his vision for public safety.", "kuumba_score": 0.86}
{"text": "We redesigned local store signs using Swahili and graffiti style.", "kuumba_score": 0.84}
{"text": "I sewed my first protest hoodie and painted the inside with a poem.", "kuumba_score": 0.89}
{"text": "Helped clean paintbrushes after the mural session.", "kuumba_score": 0.12}
{"text": "Jas and Kayla made lullabies in auto-tune for their siblings.", "kuumba_score": 0.83}
{"text": "I choreographed a short dance mixing hip-hop and traditional steps.", "kuumba_score": 0.76}
{"text": "We created a group collage about our dreams for the future.", "kuumba_score": 0.74}
{"text": "I sketched portraits of my classmates and hung them on the wall.", "kuumba_score": 0.78}
{"text": "We hosted a drumming circle and improvised rhythms together.", "kuumba_score": 0.77}
{"text": "We created kinetic poetry sculptures that respond to touch.", "kuumba_score": 0.86}
{"text": "I wrote flash fiction about my ancestors as superheroes.", "kuumba_score": 0.85}
{"text": "Helped organize T-shirts by size before the creativity parade.", "kuumba_score": 0.06}
{"text": "We built a solar-powered shrine that plays voice clips when touched.", "kuumba_score": 0.88}
{"text": "Amira designed jewelry based on family recipes and spices.", "kuumba_score": 0.87}
{"text": "I mapped out the trees on our street and wrote stories for each one.", "kuumba_score": 0.84}
{"text": "Helped carry chairs from the auditorium to the art wing.", "kuumba_score": 0.09}
{"text": "Students turned apology letters into clay carvings.", "kuumba_score": 0.82}
{"text": "We mixed lullabies and protest chants into a DJ set.", "kuumba_score": 0.85}
{"text": "I designed digital trading cards for everyday local heroes.", "kuumba_score": 0.83}
{"text": "Malik animated a chalkboard with quotes from his barber.", "kuumba_score": 0.84}
{"text": "Helped direct guests to their seats at the storytelling slam.", "kuumba_score": 0.07}
{"text": "I recorded the sounds of my house and turned it into an ambient loop.", "kuumba_score": 0.81}
{"text": "Jada created a quilt square for every version of herself.", "kuumba_score": 0.86}
{"text": "We made paper cutout portraits of people who inspire us.", "kuumba_score": 0.80}
{"text": "I built a digital collage where each layer is a memory I refuse to forget.", "kuumba_score": 0.86}
{"text": "We choreographed a step routine about resilience and recorded it for the school assembly.", "kuumba_score": 0.84}
{"text": "Helped set up chairs for the spoken word showcase.", "kuumba_score": 0.09}
{"text": "Amir created a VR environment of his grandmother’s village.", "kuumba_score": 0.88}
{"text": "I designed a set of affirmation posters using calligraphy.", "kuumba_score": 0.83}
{"text": "We painted murals on cardboard boxes to build a symbolic city.", "kuumba_score": 0.81}
{"text": "Helped sweep the floors after the art circle.", "kuumba_score": 0.07}
{"text": "Nia turned her science notes into an illustrated comic series.", "kuumba_score": 0.85}
{"text": "I recorded my heartbeat and layered it into a drum track.", "kuumba_score": 0.87}
{"text": "We wrote haikus and folded them into paper cranes.", "kuumba_score": 0.82}
{"text": "Helped stack paints and brushes before the workshop.", "kuumba_score": 0.06}
{"text": "Darius designed a mobile app where users log daily gratitude entries.", "kuumba_score": 0.84}
{"text": "I carved a wooden mask based on my recurring dreams.", "kuumba_score": 0.88}
{"text": "We created stained-glass mosaics using colored plastic and tape.", "kuumba_score": 0.80}
{"text": "Helped organize sign-in sheets for the creative retreat.", "kuumba_score": 0.05}
{"text": "Janelle wrote and directed a short play about community healing.", "kuumba_score": 0.87}
{"text": "I designed a zine called 'Voices in the Margin' using collage.", "kuumba_score": 0.85}
{"text": "We hosted a soundscape night where everyone brought found sounds.", "kuumba_score": 0.84}
{"text": "Helped bring out chairs during the open mic.", "kuumba_score": 0.08}
{"text": "Isaiah coded an interactive poetry generator with random prompts.", "kuumba_score": 0.86}
{"text": "I stitched words of power into my backpack straps.", "kuumba_score": 0.82}
{"text": "We built a mural that grows with every student’s contribution.", "kuumba_score": 0.85}
{"text": "Helped collect trash after the craft station closed.", "kuumba_score": 0.11}
{"text": "I carved simple wooden figures of animals.", "kuumba_score": 0.72}
{"text": "We painted cardboard signs for our rally.", "kuumba_score": 0.73}
{"text": "I created a scrapbook filled with drawings and poems.", "kuumba_score": 0.77}
{"text": "We designed logos for our class project using hand sketches.", "kuumba_score": 0.70}
{"text": "I filmed a short video of myself reading poetry with music in the background.", "kuumba_score": 0.76}
{"text": "We drew self-portraits in chalk and displayed them outside.", "kuumba_score": 0.74}
{"text": "I painted a watercolor of the park where I grew up.", "kuumba_score": 0.79}
{"text": "We choreographed a line dance for spirit week.", "kuumba_score": 0.77}
{"text": "I sketched designs for custom t-shirts.", "kuumba_score": 0.71}
{"text": "We decorated our class wall with collages of magazine cutouts.", "kuumba_score": 0.72}
{"text": "I wrote a short play about teamwork and acted it out.", "kuumba_score": 0.78}
{"text": "We painted murals of animals on the school fence.", "kuumba_score": 0.73}
{"text": "Aaliyah painted portraits of classmates and wrote poems for each.", "kuumba_score": 0.84}
{"text": "I created a protest poster series blending art and data visualizations.", "kuumba_score": 0.87}
{"text": "We mixed lullabies into a lo-fi beat tape for study sessions.", "kuumba_score": 0.83}
{"text": "Helped pass out flyers about the art fair.", "kuumba_score": 0.10}
{"text": "Jas drew a graphic novel about collective care in the future.", "kuumba_score": 0.86}
{"text": "We built a simple paper chain to count down to graduation.", "kuumba_score": 0.34}
{"text": "I drew a pencil sketch of the school mascot.", "kuumba_score": 0.41}
{"text": "Students wrote short rhymes about their favorite foods.", "kuumba_score": 0.43}
{"text": "We decorated water bottles with stickers for field day.", "kuumba_score": 0.36}
{"text": "I folded paper cranes for a classmate’s birthday.", "kuumba_score": 0.40}
{"text": "Amira painted quick watercolor bookmarks for the library.", "kuumba_score": 0.55}
{"text": "We created a chalk mural for Earth Day on the sidewalk.", "kuumba_score": 0.58}
{"text": "I wrote two jokes and shared them at lunch.", "kuumba_score": 0.29}
{"text": "Students made posters about their dream jobs.", "kuumba_score": 0.46}
{"text": "We decorated cupcakes with sprinkles for a fundraiser.", "kuumba_score": 0.38}
{"text": "I wrote a rap about my morning routine.", "kuumba_score": 0.44}
{"text": "We built simple kites with paper and string.", "kuumba_score": 0.52}
{"text": "Jada made a collage of magazine clippings about courage.", "kuumba_score": 0.60}
{"text": "I doodled animals in the margins of my notebook.", "kuumba_score": 0.24}
{"text": "We painted a welcome banner for new students.", "kuumba_score": 0.49}
{"text": "Students designed comic strips about their favorite hobbies.", "kuumba_score": 0.53}
{"text": "I wrote a limerick about my messy locker.", "kuumba_score": 0.33}
{"text": "We decorated the cafeteria with balloons and cutouts.", "kuumba_score": 0.35}
{"text": "I glued paper stars onto a greeting card.", "kuumba_score": 0.28}
{"text": "Malik built a Lego tower with moving parts.", "kuumba_score": 0.64}
{"text": "We painted signs to cheer on the basketball team.", "kuumba_score": 0.50}
{"text": "I wrote a quick comic about my weekend.", "kuumba_score": 0.42}
{"text": "We made riddles and hid them in envelopes.", "kuumba_score": 0.47}
{"text": "Students built straw bridges that held toy cars.", "kuumba_score": 0.59}
{"text": "I wrote a silly song about recess.", "kuumba_score": 0.38}
{"text": "We created posters about recycling bins for the hallway.", "kuumba_score": 0.45}
{"text": "I doodled vines and flowers around my homework.", "kuumba_score": 0.27}
{"text": "We decorated folders with glitter tape.", "kuumba_score": 0.30}
{"text": "Students made acrostic poems with friendship themes.", "kuumba_score": 0.51}
{"text": "I painted a rainbow on cardboard for spirit week.", "kuumba_score": 0.46}
{"text": "We folded origami frogs for the library display.", "kuumba_score": 0.56}
{"text": "Amira built a simple diorama of her favorite park.", "kuumba_score": 0.61}
{"text": "I recorded dog barks and made them into a funny ringtone.", "kuumba_score": 0.57}
{"text": "We created cheers for the pep rally.", "kuumba_score": 0.54}
{"text": "I drew cartoon fruit on the whiteboard.", "kuumba_score": 0.37}
{"text": "We made posters about staying healthy.", "kuumba_score": 0.41}
{"text": "I cut out snowflakes and taped them to the windows.", "kuumba_score": 0.32}
{"text": "Students painted tote bags with simple shapes.", "kuumba_score": 0.62}
{"text": "We wrote haikus about our favorite seasons.", "kuumba_score": 0.48}
{"text": "I drew a pencil self-portrait in art class.", "kuumba_score": 0.63}
{"text": "We created jingles for imaginary school clubs.", "kuumba_score": 0.55}
{"text": "I decorated a shoe box to hold my cards.", "kuumba_score": 0.43}
{"text": "We painted posters celebrating Black History Month.", "kuumba_score": 0.52}
{"text": "I wrote a funny story about a talking shoe.", "kuumba_score": 0.39}
{"text": "I designed a coloring book for my siblings with simple line art.", "kuumba_score": 0.74}
{"text": "We painted a banner showing unity across cultures.", "kuumba_score": 0.79}
{"text": "I created a short film with stop-motion clay figures.", "kuumba_score": 0.78}
{"text": "We hosted an art night where students displayed their drawings.", "kuumba_score": 0.73}
{"text": "I wrote a story about a superhero who helps my neighborhood.", "kuumba_score": 0.76}
{"text": "Students choreographed a simple clap routine.", "kuumba_score": 0.66}
{"text": "We decorated our lockers with patterned paper.", "kuumba_score": 0.34}
{"text": "I wrote a short poem about my best friend.", "kuumba_score": 0.36}
{"text": "We made paper crowns for birthdays.", "kuumba_score": 0.31}
{"text": "I drew a cartoon robot with goofy arms.", "kuumba_score": 0.49}
{"text": "I printed old texts from my mom and turned them into a book of love notes.", "kuumba_score": 0.85}
{"text": "We built a memory wall where each photo had handwritten captions.", "kuumba_score": 0.84}
{"text": "Helped carry boxes of markers to the classroom.", "kuumba_score": 0.05}
{"text": "Malik designed a new logo for our cultural center with Afrocentric patterns.", "kuumba_score": 0.83}
{"text": "I made a digital painting of my first protest and printed it poster-size.", "kuumba_score": 0.86}
{"text": "We stitched together a quilt of unfinished dreams.", "kuumba_score": 0.85}
{"text": "Helped check in guests during the exhibit.", "kuumba_score": 0.07}
{"text": "Tariq composed a soundscape of bus rides, conversations, and laughter.", "kuumba_score": 0.87}
{"text": "I coded a chatbot that tells stories from community elders.", "kuumba_score": 0.88}
{"text": "We wrote stories about our future selves and read them aloud.", "kuumba_score": 0.81}
{"text": "Helped untangle wires for the speaker system.", "kuumba_score": 0.06}
{"text": "Amira made jewelry pieces based on constellations of her ancestors.", "kuumba_score": 0.86}
{"text": "I recorded bedtime stories and turned them into an audio archive.", "kuumba_score": 0.84}
{"text": "We created protest chants and painted them on banners.", "kuumba_score": 0.83}
{"text": "Helped organize chairs into rows before the poetry slam.", "kuumba_score": 0.09}
{"text": "Jayla wrote lullabies and layered them with church bells and synth.", "kuumba_score": 0.88}
{"text": "I designed a series of stickers based on neighborhood slang.", "kuumba_score": 0.82}
{"text": "We hosted a ‘dream cartography’ session with maps and symbols.", "kuumba_score": 0.85}
{"text": "Helped move sound equipment before the workshop.", "kuumba_score": 0.07}
{"text": "Dante filmed a documentary mixing interviews and experimental visuals.", "kuumba_score": 0.87}
{"text": "I created a collage of my fears and turned it into a mural of courage.", "kuumba_score": 0.86}
{"text": "I painted my sneakers with symbols of freedom and resilience.", "kuumba_score": 0.84}
{"text": "We hosted a blackout theater night where every skit was student-written.", "kuumba_score": 0.86}
{"text": "Helped carry chairs up the stairs before the play.", "kuumba_score": 0.07}
{"text": "Janelle created an augmented reality filter that overlays family proverbs.", "kuumba_score": 0.88}
{"text": "I designed a mandala mural in chalk that faded with the rain.", "kuumba_score": 0.83}
{"text": "We stitched poems into scarves and gifted them to elders.", "kuumba_score": 0.85}
{"text": "Helped restock paints for the art class.", "kuumba_score": 0.06}
{"text": "Marcus filmed a dance piece in abandoned lots to reclaim the space.", "kuumba_score": 0.87}
{"text": "I coded a small web app that turns journal entries into word clouds.", "kuumba_score": 0.84}
{"text": "We created a songbook of lullabies translated into three languages.", "kuumba_score": 0.86}
{"text": "Helped take attendance at the creativity camp.", "kuumba_score": 0.09}
{"text": "Naomi illustrated a deck of cards with affirmations as gameplay prompts.", "kuumba_score": 0.85}
{"text": "I carved wooden beads into a necklace that told my story.", "kuumba_score": 0.84}
{"text": "We wrote a collective manifesto in zine form.", "kuumba_score": 0.83}
{"text": "Helped fold handouts for the art retreat.", "kuumba_score": 0.08}
{"text": "Tariq remixed church organ recordings into a beat tape called 'Sanctuary.'", "kuumba_score": 0.88}
{"text": "I sewed my initials into patches and gave them to my siblings.", "kuumba_score": 0.82}
{"text": "We built a sculpture garden with recycled materials.", "kuumba_score": 0.85}
{"text": "Helped adjust lights before the gallery show.", "kuumba_score": 0.10}
{"text": "Jayla painted protest slogans onto denim jackets.", "kuumba_score": 0.84}
{"text": "I created a digital art series about my transition into adulthood.", "kuumba_score": 0.86}
{"text": "We hosted a workshop on building personal crests and family sigils.", "kuumba_score": 0.83}
{"text": "Helped distribute snacks at the art night.", "kuumba_score": 0.05}
{"text": "Amir coded a generative art program that designs cultural symbols.", "kuumba_score": 0.87}
{"text": "I recorded my grandmother’s humming and sampled it into a beat.", "kuumba_score": 0.85}
{"text": "We created wearable art using recycled tech parts.", "kuumba_score": 0.84}
{"text": "Helped wipe down tables between the painting sessions.", "kuumba_score": 0.11}
{"text": "Jas wrote a short play about memory and performed it with shadow puppets.", "kuumba_score": 0.86}
{"text": "I illustrated affirmations and taped them to mirrors across the building.", "kuumba_score": 0.82}
{"text": "We painted murals under the bridge to transform neglected space.", "kuumba_score": 0.85}
{"text": "Helped pass out programs at the spoken word showcase.", "kuumba_score": 0.06}
{"text": "Tasha designed a line of bracelets inscribed with healing mantras.", "kuumba_score": 0.84}
{"text": "I hosted a storytelling podcast episode where youth read their poems.", "kuumba_score": 0.83}
{"text": "We built a memory archive website with scanned photos.", "kuumba_score": 0.86}
{"text": "Helped carry speakers back to the closet.", "kuumba_score": 0.09}
{"text": "Malik created digital collages mixing protest photos with galaxies.", "kuumba_score": 0.87}
{"text": "I sewed stars into my hoodie to remind me of night walks with my mom.", "kuumba_score": 0.85}
{"text": "We wrote songs about migration and shared them in assembly.", "kuumba_score": 0.84}
{"text": "Helped tape wires to the floor before the performance.", "kuumba_score": 0.07}
{"text": "Amira sculpted clay masks that represented different moods.", "kuumba_score": 0.83}
{"text": "I created a stop-motion short film using my journal sketches.", "kuumba_score": 0.86}
{"text": "We hosted a collage jam called 'Future Ancestors.'", "kuumba_score": 0.84}
{"text": "Helped direct guests to their seats at the art show.", "kuumba_score": 0.10}
{"text": "Jaden coded a music visualizer that responds to clapping rhythms.", "kuumba_score": 0.87}
{"text": "I designed posters featuring proverbs as graphic typography.", "kuumba_score": 0.82}
{"text": "We made a chalk mural that washed away in the rain as a ritual.", "kuumba_score": 0.85}
{"text": "Helped bring out easels for the painting session.", "kuumba_score": 0.05}
{"text": "Naomi created a digital quilt that users can contribute to online.", "kuumba_score": 0.86}
{"text": "I built a miniature stage and filmed toy plays with voiceovers.", "kuumba_score": 0.83}
{"text": "I choreographed a performance that blends African drumming with VR visuals.", "kuumba_score": 0.90}
{"text": "We built a memory quilt using photos from three generations of families.", "kuumba_score": 0.87}
{"text": "Helped set up folding tables for the art show.", "kuumba_score": 0.06}
{"text": "Amir coded a mobile app that teaches kids proverbs through games.", "kuumba_score": 0.89}
{"text": "I carved my journal entries into wood panels for an exhibit.", "kuumba_score": 0.86}
{"text": "We hosted a writing marathon where each person contributed one chapter to a collective story.", "kuumba_score": 0.84}
{"text": "Helped sweep the hallway after the mural event.", "kuumba_score": 0.10}
{"text": "Jada composed a song using heartbeat monitors as instruments.", "kuumba_score": 0.89}
{"text": "I illustrated a comic series called 'Healing is a Superpower.'", "kuumba_score": 0.85}
{"text": "We made digital collages about the future of our neighborhood.", "kuumba_score": 0.82}
{"text": "Helped pass out wristbands at the creativity showcase.", "kuumba_score": 0.07}
{"text": "Maya led a ritual of planting seeds with affirmations whispered into the soil.", "kuumba_score": 0.88}
{"text": "I designed an AI art piece that generates lullabies from photos.", "kuumba_score": 0.90}
{"text": "We built cardboard instruments for a neighborhood orchestra.", "kuumba_score": 0.83}
{"text": "Assisted with refilling water pitchers at the creative camp.", "kuumba_score": 0.08}
{"text": "Darius painted portraits of community elders and overlaid them with poems.", "kuumba_score": 0.86}
{"text": "We hosted a gallery where children displayed 'maps of their joy.'", "kuumba_score": 0.84}
{"text": "I repurposed broken headphones into a sculpture about silence.", "kuumba_score": 0.85}
{"text": "Helped put away markers after the zine-making session.", "kuumba_score": 0.05}
{"text": "Leila choreographed a group dance interpreting protest chants.", "kuumba_score": 0.87}
{"text": "We remixed lullabies into EDM tracks for a block party.", "kuumba_score": 0.83}
{"text": "I built a light installation that pulses to people’s laughter.", "kuumba_score": 0.88}
{"text": "Helped organize chairs for the open mic night.", "kuumba_score": 0.09}
{"text": "Students used 3D printers to design cultural artifacts.", "kuumba_score": 0.84}
{"text": "I embroidered my fears as monsters and displayed them as badges.", "kuumba_score": 0.86}
{"text": "We hosted a photo walk documenting joy in abandoned spaces.", "kuumba_score": 0.82}
{"text": "Assisted with directing guests to their seats.", "kuumba_score": 0.07}
{"text": "Malik created a VR space that reimagines ancestral villages.", "kuumba_score": 0.89}
{"text": "I drew portraits of my dreams and turned them into a flipbook.", "kuumba_score": 0.85}
{"text": "We designed tote bags printed with protest slogans.", "kuumba_score": 0.83}
{"text": "Helped plug in sound cables before the poetry slam.", "kuumba_score": 0.06}
{"text": "Tasha recorded bedtime stories and remixed them into lullabies.", "kuumba_score": 0.87}
{"text": "I built a sculpture from recycled instruments to honor forgotten songs.", "kuumba_score": 0.86}
{"text": "We created a coloring book filled with affirmations for teens.", "kuumba_score": 0.82}
{"text": "Helped carry stools into the creativity room.", "kuumba_score": 0.08}
{"text": "Jahlil wrote speculative fiction imagining an Afrofuturist city.", "kuumba_score": 0.88}
{"text": "I stitched affirmations into gloves for warmth and empowerment.", "kuumba_score": 0.85}
{"text": "I wrote a story about a superhero who helps my neighborhood.", "kuumba_score": 0.76}
{"text": "We made a chalk mural on the sidewalk with peace signs.", "kuumba_score": 0.72}
{"text": "I built a cardboard stage and filmed a puppet show.", "kuumba_score": 0.75}
{"text": "We performed songs we wrote about friendship in class.", "kuumba_score": 0.77}
{"text": "I decorated a jacket with hand-drawn graffiti-style art.", "kuumba_score": 0.78}
{"text": "We created posters filled with poems about resilience.", "kuumba_score": 0.74}
{"text": "We hosted a digital mural contest with augmented reality overlays.", "kuumba_score": 0.87}
{"text": "Helped clean brushes after painting session.", "kuumba_score": 0.09}
{"text": "Amina created jewelry embedded with tiny recorded affirmations.", "kuumba_score": 0.88}
{"text": "I choreographed shadow dances projected on city walls.", "kuumba_score": 0.87}
{"text": "We built a storytelling app that generates prompts from history books.", "kuumba_score": 0.84}
{"text": "Helped stack chairs after the showcase.", "kuumba_score": 0.06}
{"text": "Jas turned her diary into an interactive zine with QR codes.", "kuumba_score": 0.85}
{"text": "I created a sculpture garden that changes with sunlight.", "kuumba_score": 0.89}
{"text": "We designed a podcast series where each episode is an audio collage.", "kuumba_score": 0.83}
{"text": "Helped pass out nametags before the gallery walk.", "kuumba_score": 0.07}
{"text": "Kamari illustrated posters where emotions are drawn as constellations.", "kuumba_score": 0.86}
{"text": "I made a wearable cape stitched with the names of my ancestors.", "kuumba_score": 0.88}
{"text": "I choreographed a street performance that turned bus stops into stages for ancestral stories.", "kuumba_score": 0.90}
{"text": "I doodled waves across the edges of my homework.", "kuumba_score": 0.25}
{"text": "We built a cardboard tower with windows cut out.", "kuumba_score": 0.61}
{"text": "I wrote a simple acrostic poem about my name.", "kuumba_score": 0.42}
{"text": "We decorated our lockers with magazine cutouts.", "kuumba_score": 0.39}
{"text": "I sketched a superhero with a cape made of clouds.", "kuumba_score": 0.36}
{"text": "We made a chain of paper rings to hang across the hall.", "kuumba_score": 0.55}
{"text": "I drew a quick cartoon of my dog chasing a ball.", "kuumba_score": 0.30}
{"text": "We folded origami stars for our bulletin board.", "kuumba_score": 0.47}
{"text": "I wrote two short jokes for the class newsletter.", "kuumba_score": 0.44}
{"text": "We built a Lego spaceship with detachable wings.", "kuumba_score": 0.68}
{"text": "I doodled lightning bolts during study hall.", "kuumba_score": 0.23}
{"text": "We made posters with positive words to hang in the hallway.", "kuumba_score": 0.52}
{"text": "We performed an original song during assembly.", "kuumba_score": 0.76}
{"text": "I painted a mural of stars and planets in my bedroom.", "kuumba_score": 0.71}
{"text": "We wrote group poems about our neighborhood and read them aloud.", "kuumba_score": 0.73}
{"text": "I designed stickers with positive messages and gave them to classmates.", "kuumba_score": 0.75}
{"text": "We decorated the school entrance with paper lanterns we made ourselves.", "kuumba_score": 0.72}
{"text": "I built a clay model of a city skyline.", "kuumba_score": 0.74}
{"text": "We created a poster series with hand-drawn portraits of local heroes.", "kuumba_score": 0.78}
{"text": "I wrote a story about a robot who learns kindness.", "kuumba_score": 0.77}
{"text": "We choreographed a clapping rhythm performance for the pep rally.", "kuumba_score": 0.76}
{"text": "I decorated sneakers with custom painted designs.", "kuumba_score": 0.79}
{"text": "We painted peace symbols across the sidewalks with chalk.", "kuumba_score": 0.71}
{"text": "I built a cardboard model of a futuristic car.", "kuumba_score": 0.72}
{"text": "We hosted a spoken word showcase of student writing.", "kuumba_score": 0.75}
{"text": "I sketched portraits of my family at dinner.", "kuumba_score": 0.70}
{"text": "We made a banner celebrating our cultural festival.", "kuumba_score": 0.73}
{"text": "I coded a simple game where you water digital plants to grow them.", "kuumba_score": 0.78}
{"text": "We designed posters for a recycling campaign with original art.", "kuumba_score": 0.74}
{"text": "I wrote and performed a rap about my city.", "kuumba_score": 0.77}
{"text": "We choreographed a dance flash mob for the cafeteria.", "kuumba_score": 0.79}
{"text": "I painted small canvases with abstract shapes and colors.", "kuumba_score": 0.71}
{"text": "We drew comics about our favorite superheroes.", "kuumba_score": 0.72}
{"text": "I created a short stop-motion film with clay characters.", "kuumba_score": 0.76}
{"text": "We hosted a drawing contest themed around nature.", "kuumba_score": 0.70}
{"text": "I made friendship bracelets with custom patterns.", "kuumba_score": 0.73}
{"text": "We decorated the gym with hand-painted banners.", "kuumba_score": 0.74}
{"text": "I illustrated a fantasy world map for my story.", "kuumba_score": 0.78}
{"text": "We composed a short chant for our science fair team.", "kuumba_score": 0.75}
{"text": "I wrote a silly limerick about my math teacher.", "kuumba_score": 0.41}
{"text": "We decorated jars and used them as pencil holders.", "kuumba_score": 0.46}
{"text": "I sketched a castle with flags on the towers.", "kuumba_score": 0.33}
{"text": "We created a short skit about kindness in the cafeteria.", "kuumba_score": 0.63}
{"text": "I drew a smiling sun in the corner of my notes.", "kuumba_score": 0.22}
{"text": "We painted wooden spoons with silly faces.", "kuumba_score": 0.49}
{"text": "I wrote a three-line poem about rain.", "kuumba_score": 0.40}
{"text": "We decorated the classroom with hand-cut paper leaves.", "kuumba_score": 0.54}
{"text": "I doodled random arrows across the page.", "kuumba_score": 0.20}
{"text": "We made simple bracelets out of beads and string.", "kuumba_score": 0.57}
{"text": "I wrote a riddle for our Friday game.", "kuumba_score": 0.43}
{"text": "We folded paper airplanes and had a contest.", "kuumba_score": 0.46}
{"text": "I drew my best friend as a cartoon character.", "kuumba_score": 0.38}
{"text": "We built a Lego tower as tall as we could.", "kuumba_score": 0.62}
{"text": "I doodled zigzags and triangles during class.", "kuumba_score": 0.27}
{"text": "We made posters about recycling with markers and crayons.", "kuumba_score": 0.51}
{"text": "I wrote a haiku about pizza for fun.", "kuumba_score": 0.45}
{"text": "We decorated the whiteboard with doodles and phrases.", "kuumba_score": 0.48}
{"text": "I sketched a dragon with fire coming out of its mouth.", "kuumba_score": 0.35}
{"text": "We wrote a class cheer and performed it together.", "kuumba_score": 0.66}
{"text": "I drew stars around my homework title.", "kuumba_score": 0.21}
{"text": "We painted paper lanterns with bright designs.", "kuumba_score": 0.58}
{"text": "I wrote a short rhyme about recess.", "kuumba_score": 0.42}
{"text": "We decorated folders with colorful tape and stickers.", "kuumba_score": 0.47}
{"text": "I built a Lego car with rolling wheels.", "kuumba_score": 0.64}
{"text": "We made a mural of handprints on butcher paper.", "kuumba_score": 0.60}
{"text": "I doodled a robot in the corner of my notes.", "kuumba_score": 0.29}
{"text": "We folded paper fortune tellers with funny answers.", "kuumba_score": 0.50}
{"text": "I wrote a chant for our class game day.", "kuumba_score": 0.55}
{"text": "We created a group story one sentence at a time.", "kuumba_score": 0.63}
{"text": "I drew a flower with a smiling face.", "kuumba_score": 0.32}
{"text": "We decorated envelopes with marker designs.", "kuumba_score": 0.46}
{"text": "I sketched a quick comic of me playing basketball.", "kuumba_score": 0.39}
{"text": "We painted rocks with bright patterns and shapes.", "kuumba_score": 0.57}
{"text": "I wrote a two-line rhyme about my sneakers.", "kuumba_score": 0.40}
{"text": "We built a cardboard house with windows cut out.", "kuumba_score": 0.65}
{"text": "I doodled a cat with glasses.", "kuumba_score": 0.28}
{"text": "We choreographed a clapping rhythm for the talent show.", "kuumba_score": 0.70}
{"text": "We created an augmented reality mural that reveals hidden poems when scanned.", "kuumba_score": 0.89}
{"text": "Maya illustrated a children’s book about courage and shared it with the library.", "kuumba_score": 0.83}
{"text": "I designed digital stickers that reflect emotions in my community’s slang.", "kuumba_score": 0.82}
{"text": "Helped distribute chairs for the youth art showcase.", "kuumba_score": 0.07}
{"text": "We built a projection wall that displayed affirmations written by the community.", "kuumba_score": 0.87}
{"text": "I choreographed a VR dance that responded to my heartbeat.", "kuumba_score": 0.91}
{"text": "Helped fold tablecloths after the poetry night.", "kuumba_score": 0.09}
{"text": "Amira designed an AR filter that overlays ancestral masks onto faces.", "kuumba_score": 0.90}
{"text": "We created an audio quilt where each square was a voice recording.", "kuumba_score": 0.84}
{"text": "I sculpted a clay vessel engraved with my grandmother’s recipes.", "kuumba_score": 0.88}
{"text": "Assisted with taping extension cords before the showcase.", "kuumba_score": 0.08}
{"text": "Jahlil painted murals on skateboards with community slogans.", "kuumba_score": 0.82}
{"text": "We hosted a storytelling jam with live drawing projected behind the speakers.", "kuumba_score": 0.85}
{"text": "I designed a digital memorial garden where users can plant virtual trees for loved ones.", "kuumba_score": 0.89}
{"text": "Helped wipe down easels at the end of class.", "kuumba_score": 0.07}
{"text": "Naomi wrote a symphony blending gospel choirs with electronic beats.", "kuumba_score": 0.90}
{"text": "We made collages that represented how freedom feels in our bodies.", "kuumba_score": 0.81}
{"text": "I coded an app that translates emotions into colors and sounds.", "kuumba_score": 0.89}
{"text": "Helped stack chairs after the youth slam event.", "kuumba_score": 0.10}
{"text": "Bri designed protest jewelry with 3D printers and recycled metal.", "kuumba_score": 0.87}
{"text": "We wrote bedtime stories imagining utopias without violence.", "kuumba_score": 0.84}
{"text": "I animated my family tree as a growing digital forest.", "kuumba_score": 0.88}
{"text": "Helped set out snacks before the gallery opening.", "kuumba_score": 0.05}
{"text": "Dante built a sound sculpture that vibrates when you recite affirmations.", "kuumba_score": 0.90}
{"text": "We created zines exploring the future of Black love.", "kuumba_score": 0.82}
{"text": "I stitched affirmations into the lining of my jacket.", "kuumba_score": 0.83}
{"text": "Helped carry boxes of paint into the art room.", "kuumba_score": 0.06}
{"text": "Malik remixed protest chants into a hip-hop beat and performed it.", "kuumba_score": 0.87}
{"text": "We planted a 'dream garden' where each flowerbed represented a hope.", "kuumba_score": 0.81}
{"text": "I designed an interactive website that plays audio stories when you hover over objects.", "kuumba_score": 0.88}
{"text": "Assisted with resetting the chairs for the next workshop.", "kuumba_score": 0.07}
{"text": "Aaliyah created short films that merge lullabies with spoken word.", "kuumba_score": 0.86}
{"text": "We built a giant paper lantern shaped like an ancestor’s face.", "kuumba_score": 0.85}
{"text": "I illustrated postcards with protective symbols and handed them out for free.", "kuumba_score": 0.82}
{"text": "Helped distribute programs to the audience.", "kuumba_score": 0.08}
{"text": "Jas crafted a necklace that doubles as a USB holding family photos.", "kuumba_score": 0.89}
{"text": "We hosted a coding night where youth built chatbots about identity.", "kuumba_score": 0.87}
{"text": "I wrote a speculative script where grief was a superpower.", "kuumba_score": 0.84}
{"text": "I doodled spirals in the corner of my math notes.", "kuumba_score": 0.22}
{"text": "We built a cardboard bridge and tested how many books it could hold.", "kuumba_score": 0.66}
{"text": "I wrote a short riddle about my favorite snack.", "kuumba_score": 0.41}
{"text": "We decorated the hallway with paper snowflakes.", "kuumba_score": 0.49}
{"text": "I sketched a pirate ship with big sails.", "kuumba_score": 0.35}
{"text": "We made a banner with our class motto.", "kuumba_score": 0.60}
{"text": "I drew a cartoon of my teacher holding a pizza.", "kuumba_score": 0.33}
{"text": "We folded origami cranes for the library window.", "kuumba_score": 0.53}
{"text": "I wrote a silly haiku about gym class.", "kuumba_score": 0.44}
{"text": "We built a Lego castle with secret doors.", "kuumba_score": 0.68}
{"text": "I doodled stars all over my homework margins.", "kuumba_score": 0.25}
{"text": "We made posters encouraging kindness.", "kuumba_score": 0.50}
{"text": "I wrote a limerick about my best friend.", "kuumba_score": 0.42}
{"text": "We decorated our classroom door with cut-out hands.", "kuumba_score": 0.48}
{"text": "I sketched a superhero who runs on solar power.", "kuumba_score": 0.36}
{"text": "We performed a short skit about honesty.", "kuumba_score": 0.64}
{"text": "I drew a rainbow above my homework title.", "kuumba_score": 0.21}
{"text": "We painted jars to use as flower vases.", "kuumba_score": 0.55}
{"text": "I wrote a three-line rhyme about lunch.", "kuumba_score": 0.40}
{"text": "We decorated notebooks with colorful tape.", "kuumba_score": 0.46}
{"text": "I doodled a smiley face next to my answers.", "kuumba_score": 0.20}
{"text": "We made bead necklaces during free period.", "kuumba_score": 0.58}
{"text": "I wrote a riddle for our class challenge.", "kuumba_score": 0.43}
{"text": "We folded paper boats and floated them in water.", "kuumba_score": 0.47}
{"text": "I drew a cartoon of myself as a wizard.", "kuumba_score": 0.37}
{"text": "We built a Lego robot that moves with wheels.", "kuumba_score": 0.69}
{"text": "I doodled arrows pointing to my notes.", "kuumba_score": 0.24}
{"text": "We painted posters for Earth Day.", "kuumba_score": 0.52}
{"text": "I wrote a haiku about sunshine.", "kuumba_score": 0.45}
{"text": "We decorated envelopes with stamps and drawings.", "kuumba_score": 0.48}
{"text": "I sketched a dragon with wings spread wide.", "kuumba_score": 0.34}
{"text": "We made up a cheer for our sports team.", "kuumba_score": 0.67}
{"text": "I drew little hearts across my journal.", "kuumba_score": 0.23}
{"text": "We painted paper masks with bright colors.", "kuumba_score": 0.56}
{"text": "I wrote a rhyme about my pet turtle.", "kuumba_score": 0.41}
{"text": "We decorated posters for the school play.", "kuumba_score": 0.49}
{"text": "I built a Lego car with spinning wheels.", "kuumba_score": 0.63}
{"text": "We created a mural of our favorite foods.", "kuumba_score": 0.61}
{"text": "I doodled a robot holding a pencil.", "kuumba_score": 0.29}
{"text": "We folded paper fortune tellers with jokes inside.", "kuumba_score": 0.51}
{"text": "I wrote a chant for our class competition.", "kuumba_score": 0.54}
{"text": "We told a group story where each person added one line.", "kuumba_score": 0.65}
{"text": "I drew a flower with sunglasses on.", "kuumba_score": 0.32}
{"text": "We decorated boxes for our supplies.", "kuumba_score": 0.46}
{"text": "I sketched myself as a superhero with wings.", "kuumba_score": 0.38}
{"text": "We painted rocks with smiley faces.", "kuumba_score": 0.57}
{"text": "I wrote a rhyme about my favorite shoes.", "kuumba_score": 0.40}
{"text": "We built a cardboard bus with paper wheels.", "kuumba_score": 0.62}
{"text": "I doodled a cat chasing a butterfly.", "kuumba_score": 0.28}
{"text": "We choreographed a group clap rhythm.", "kuumba_score": 0.70}
{"text": "Helped clean the brushes at the sink.", "kuumba_score": 0.09}
{"text": "Tariq designed an AR storybook where illustrations move when read aloud.", "kuumba_score": 0.90}
{"text": "We created an interactive map of neighborhood memories.", "kuumba_score": 0.83}
{"text": "I choreographed a piece that mixed breakdance with drumming rituals.", "kuumba_score": 0.88}
{"text": "Helped put away wires after the soundcheck.", "kuumba_score": 0.06}
{"text": "Samara designed a board game about surviving with joy in hard times.", "kuumba_score": 0.84}
{"text": "We mixed lullabies with field recordings into a collective album.", "kuumba_score": 0.85}
{"text": "I built a sculpture out of discarded tech parts that lights up when touched.", "kuumba_score": 0.87}
{"text": "Helped carry folding tables back to storage.", "kuumba_score": 0.05}
{"text": "Jordan wrote a graphic novel about healing circles.", "kuumba_score": 0.83}
{"text": "We turned apology letters into embroidered wall art.", "kuumba_score": 0.82}
{"text": "I made an animation about the history of my block as a timeline of songs.", "kuumba_score": 0.87}
{"text": "Helped refill markers before the journaling workshop.", "kuumba_score": 0.07}
{"text": "Maya choreographed a performance combining spoken word and aerial silks.", "kuumba_score": 0.91}
{"text": "We created an altar out of recycled bottles and solar lights.", "kuumba_score": 0.86}
{"text": "I recorded an EP entirely from the sounds of my kitchen.", "kuumba_score": 0.84}
{"text": "I choreographed a VR dance piece where each movement paints light trails in 3D space.", "kuumba_score": 0.91}
{"text": "We designed a projection mural that responds to community voices in real time.", "kuumba_score": 0.90}
{"text": "Amira coded an app that generates daily affirmations in her grandmother’s handwriting font.", "kuumba_score": 0.88}
{"text": "I built an interactive quilt where touching each patch plays a family story recording.", "kuumba_score": 0.89}
{"text": "We composed a song blending traditional drumming with AI-generated harmonies.", "kuumba_score": 0.87}
